In [1]:
import pandas as pd
import numpy as np

In [2]:
path = 'datasets/postcode_lookups.csv'

In [3]:
df = pd.read_csv(path)

/anaconda3/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3020: DtypeWarning: Columns (13) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [4]:
df.head()

,pcd7,pcd8,pcds,dointr,doterm,usertype,oa11,lsoa11cd,msoa11cd,ladcd,lsoa11nm,msoa11nm,ladnm,ladnmw,FID
0,AB1 1EZ,AB1 1EZ,AB1 1EZ,198001,199606,0,S00090528,S01006645,S02001261,S12000033,George Street - 01,George Street,Aberdeen City,NaN,1
1,AB1 0AA,AB1 0AA,AB1 0AA,198001,199606,0,S00090303,S01006514,S02001237,S12000033,"Cults, Bieldside and Milltimber West - 02","Cults, Bieldside and Milltimber West",Aberdeen City,NaN,2
2,AB1 0RE,AB1 0RE,AB1 0RE,198001,199606,0,S00090294,S01006507,S02001236,S12000033,Culter - 02,Culter,Aberdeen City,NaN,3
3,AB1 1FA,AB1 1FA,AB1 1FA,198001,199606,0,S00090532,S01006645,S02001261,S12000033,George Street - 01,George Street,Aberdeen City,NaN,4
4,AB1 0RF,AB1 0RF,AB1 0RF,199210,199606,0,S00090296,S01006507,S02001236,S12000033,Culter - 02,Culter,Aberdeen City,NaN,5

In [5]:
df.columns

Index(['pcd7', 'pcd8', 'pcds', 'dointr', 'doterm', 'usertype', 'oa11',
       'lsoa11cd', 'msoa11cd', 'ladcd', 'lsoa11nm', 'msoa11nm', 'ladnm',
       'ladnmw', 'FID'],
      dtype='object')

In [6]:
cols_to_drop = ['pcd7', 'pcd8','dointr', 'doterm', 'usertype', 'oa11',
       'lsoa11cd','lsoa11nm','ladnmw', 'FID']

In [7]:
df.drop(columns=cols_to_drop, inplace=True)

In [8]:
df.shape

(2599368, 5)

In [9]:
df.sample(10)

,pcds,msoa11cd,ladcd,msoa11nm,ladnm
2218771,SW18 3WA,E02000941,E09000032,Wandsworth 019,Wandsworth
1215093,LE1 1RS,E02006851,E06000016,Leicester 041,Leicester
214927,BN1 9PH,E02003492,E06000043,Brighton and Hove 002,Brighton and Hove
13657,AB21 9PD,S02001276,S12000033,Bucksburn South,Aberdeen City
72985,B4 7DH,E02001876,E08000025,Birmingham 050,Birmingham
2583967,YO62 6EY,E02005788,E07000167,Ryedale 001,Ryedale
566509,CW5 7FF,E02003836,E06000049,Cheshire East 047,Cheshire East
53394,B11 3LB,E02006901,E08000025,Birmingham 140,Birmingham
1407584,ME17 1XA,E02005078,E07000110,Maidstone 011,Maidstone
2242006,SY1 2LG,E02006031,E06000051,Shropshire 017,Shropshire

In [10]:
df.pcds.nunique()

2599368

In [11]:
print(df.msoa11cd.str.contains('S').sum()) #scotland
print(df.msoa11cd.str.contains('E').sum()) #england
print(df.msoa11cd.str.contains('W').sum()) #wales
print(df.msoa11cd.str.contains('N').sum()) #northern ireland

222185
2167873
137623
58788

In [12]:
mask_ew = df.msoa11cd.str.contains('E|W') #I only want to keep english + welsh postcodes

In [13]:
df_ew = df[mask_ew]

In [14]:
df_ew.head()

          pcds   msoa11cd      ladcd       msoa11nm      ladnm
33400  AL1 1EZ  E02004935  E07000240  St Albans 012  St Albans
33401  AL1 1AP  E02004940  E07000240  St Albans 017  St Albans
33402  AL1 1FH  E02004936  E07000240  St Albans 013  St Albans
33403  AL1 1AQ  E02004940  E07000240  St Albans 017  St Albans
33404  AL1 1FP  E02004937  E07000240  St Albans 014  St Albans

In [15]:
df_ew.columns = ['postcode', 'msoa_code', 'la_code', 'msoa', 'la']

In [16]:
df_ew.head(2)

      postcode  msoa_code    la_code           msoa         la
33400  AL1 1EZ  E02004935  E07000240  St Albans 012  St Albans
33401  AL1 1AP  E02004940  E07000240  St Albans 017  St Albans

In [17]:
def return_msoa(pc): 
    pc_mask = (df_ew.postcode == pc)
    return df_ew[pc_mask].msoa

In [18]:
return_msoa('AL1 1EZ')

33400    St Albans 012
Name: msoa, dtype: object

In [19]:
df_ew.to_csv(r'datasets/clean_data/postcode_lookups.csv', index = None, header=True)